{
  "name": "Sanket Chavan",
  "label": "Data Analyst/Engineer",
  "image_path": "img/1742631126842.jpeg",
  "resume_file": "Resume-Sanket Chavan-JAX.pdf",
  "contact": {
    "email": "chavansanket193@gmail.com",
    "phone": "+1 716-578-9525",
    "location": "Jacksonville, FL, USA (open to relocation)"
  },
  "summary": "Data Analyst/Engineer with 5 years of experience in banking and IT, specializing in SQL, Python, Data Warehousing, and Visualization. Proficient in Tableau and Power BI, with demonstrated expertise in developing scalable, data-driven BI solutions and transforming complex data into actionable insights. Skilled in translating business requirements into analytical frameworks, enhancing business performance, and driving strategic decision-making with strong business acumen",
  "base_url": "127.0.0.1:5500",
  "social_links": [
    {
      "label": "LinkedIn",
      "url": "https://www.linkedin.com/in/sanketchavan08/",
      "svg_path": "img/linkedin.svg"
    },
    {
      "label": "Github",
      "url": "https://github.com/sanketchavan08",
      "svg_path": "img/github.svg"
    }
  ],
  "work_experience": [
    {
      "company": "Deutsche Bank",
      "position": "Data Analyst/Engineer",
      "url": "https://www.db.com",
      "start_date": "Nov 2020",
      "end_date": "Present",
      "summary": "Project: Employee Trading Compliance Applications (SQL, Python, Power BI)",
      "highlights": [
        "Managing two major compliance applications as Client Service Manager (CSM-1), overseeing releases, capacity planning, and infrastructure updates to ensure seamless operations.",
        "Acting as the primary contact for Compliance Officers and senior stakeholders, delivering BI solutions and generating ad-hoc compliance data reports.",
        "Implemented data integrity controls on 131 feeds from 52 brokers, reducing regulatory risk from incomplete or missing feeds by 85%. Enabled 100% near real-time visibility for compliance officers, ensuring timely detection of data issues. Automated incident creation via ServiceNow, cutting investigation timelines from 4-5 days to 1-2 hours.",
        "Deployed a shell script + Oracle-based solution, automating 70–80% of recurring compliance reports and dropping L2 weekly requests from 150+ to around 40. Standardized reporting formats and speed up delivery from days to minutes.",
        "Defined 13 KPIs for tracking L2 team performance, cutting average incident resolution from 5 days to ~24 hours. Led and trained a 16-member global team, raising user satisfaction scores and scaling the solution to 18+ compliance applications.",
        "Drove a 92% reduction in privileged access over 2 years by implementing Ansible-based automation. Achieved consistently low risk scores and full audit traceability, with every production action now fully logged and compliant.",
        "Built the initial data model and pipeline in Azure Synapse Analytics to centralize compliance data for advanced analytics. Enhanced KPI reporting and facilitated future integrations with BI tools like Power BI"
      ]
    },
    {
      "company": "People Tech Group",
      "position": "Junior Data Scientist",
      "url": "https://peopletech.com/home",
      "start_date": "Sep 2019",
      "end_date": "Nov 2020",
      "summary": "Products : Elliptica Data Platform(Python, Kafka, SQL) & Candidate Screening Chatbot (Rasa, NLP, Python)",
      "highlights": [
        "Developed fault-tolerant data connectors for both relational and non-relational databases to capture real-time data changes using Python and Kafka.",
    "Streamed database changes to Tableau dashboards through Redshift Data Warehouse, enabling real-time data visualization.",
    "Conducted stress testing on the data pipeline to ensure scalability across multiple use cases.",
    "Collaborated with cross-functional remote teams for system design and sprint planning.",
    "Led backend development for an AI-powered Candidate Screening Chatbot using Rasa and Python, integrated with PostgreSQL for data management.",
    "Built a functional chatbot prototype within two months capable of understanding user intent, extracting entities, and delivering context-aware responses."
      ]
    },
	{
      "company": "University at Buffalo",
      "position": "Data Science Research Assistant",
      "url": "https://www.buffalo.edu/",
      "start_date": "Dec 2018",
      "end_date": "Sep 2019",
      "summary": "Research Project : Spatial-Temporal Analysis on GPS data (Python, Tableau, SSIS)",
      "highlights": [
        "Spatial-Temporal Analysis on a Data collected using survey which is funded by National Institutes of Health (NIH). ",
		"Build ETL Pipeline to cleaned and ingest transformed data in MS-SQL using SSIS. ",
		"Constructed Interactive Maps for Visualizing trajectories of users and clustered those GPS points to locate the most visited places in R",
		"Analyzed and visualized social influence on travel behavior of a single user and single household in R",
		"Built the model to predict the next Activity of a user on a specific day & time using Markov Model and Conditional Probabilistic Model.  ",
		"Designed a program to find Co-location between users using python and Visualize that Social Network in Tableau Dashboard"
      ]
    },
	{
      "company": "Niagara Falls Bridge Commission",
      "position": "Data Analyst Intern",
      "url": "https://www.niagarafallsbridges.com/",
      "start_date": "Sep 2017",
      "end_date": "Dec 2017",
      "summary": "Research Project : Traffic analysis of Lewiston-Queenston Bridge (Python, ML, Excel)",
      "highlights": [
        "Performed EDA on Bridge Crossing Data to discover Patterns and Trends in traffic ",
		"Conducted the Survey to identify the characteristics and travellers' behavior on change in toll cost ",
		"Achieved 13.11% traffic reduction during peak hours using the Multinomial Logistic Regression model"
      ]
    }
  ],
  "projects": [
    {
      "title": "NYC Taxi Data Analytics with Azure Synapse (Python, SQL)",
      "highlights": [
        "Developed and optimized SQL scripts and Spark notebooks to process three years of NYC Yellow Taxi data (2021-2023) in Azure Synapse Analytics",
		"Configured dedicated SQL pools and Spark pools to manage and analyze over 100 million records efficiently.",
		"Ingested, transformed, and loaded over 1TB of data using Serverless SQL Pool, Spark Pool, and automated pipelines in Synapse.",
		"Enabled real-time analytics by integrating Synapse Link with Cosmos DB and visualized data through Power BI.",
		"Analyzed payment behaviors, identifying that 60% of trips were paid by credit card, with Queens showing a unique pattern of higher cash transactions.",
		"Developed Power BI dashboards revealing that Manhattan accounted for 40% of overall taxi demand, with demand peaking on Fridays and lowest on Sundays across all boroughs."
      ]
    },
    {
      "title": "Movie Recommender System (Python, Pytorch)",
      "highlights": [
        "Developed Item and User-Based Collaborative Models with Cosine, Pearson, and MSD similarity metrics, tuning and evaluating by measuring Hit Rates for recommended movies",
		"Trained KNN and SVD++ models to predict user ratings for unseen movies in the test set",
		"Achieved 75% accuracy in user preference prediction using a Restricted Boltzmann Machine",
		"Enhanced recommendations with an Autoencoder model, maintaining an avg difference of 1-star rating between predicted and true ratings"
      ]
      
    },
	{
      "title": "Movie Revenue Prediction (Python)",
      "highlights": [
        "Eliminated Anomalies using EDA, created 39 new features, imputed missing values using Prediction from BO XGBoost model",
		"Built Linear Regression, Bayesian Optimized Random Forest, XGBoost, LightGBM models to predict the Revenue",
		"Achieved an RMSLE score of 0.96"
      ]
      
    }
  ],
  "volunteer_experience": [
    {
      "organization": "VR Ulysses",
      "position": "Data Scientist I",
      "url": "https://www.vrulysses.com/",
      "start_date": "Oct 2019",
      "end_date": "Jan 2020",
      "summary": "As the initial data lead at VR Ulysses, I focused on preparing and analyzing network data for their innovative virtual reality visualization platform, empowering security operators with enhanced insight and collaboration."
    }
  ],
  "education": [
    {
      "institution": "University at Buffalo",
      "location": "Buffalo, NY, USA",
      "url": "https://buffalo.edu",
      "degrees": [
        "Master of Science in Industrial Engineering",
        "Focused Data Science"
      ],
      "gpa_major": "3.7/4",
      "graduation_date": "Mar 2019"
    },
    {
      "institution": "North Maharashtra University",
      "location": "Jalgaon, MH, India",
      "url": "https://sample.com",
      "degrees": ["Bachelor in Mechanical Engineering"],
      "gpa_major": "8.2/10",
      "graduation_date": "May 2016"
    }
  ],
  "skills": [
    {
      "name": "SQL",
      "proficiency": 95,
      "proficiency_label": "Proficiency Level"
    },
    {
      "name": "Python",
      "proficiency": 90,
      "proficiency_label": "Proficiency Level"
    },
	{
      "name": "Tableau/Power BI",
      "proficiency": 90,
      "proficiency_label": "Proficiency Level"
    },
	{
      "name": "Data Warehousing",
      "proficiency": 80,
      "proficiency_label": "Proficiency Level"
    },
	{
      "name": "Data Science and ML",
      "proficiency": 80,
      "proficiency_label": "Proficiency Level"
    }
  ],
  
  "certifications": [
    {
      "certification": "- Microsoft Certified: Power BI Data Analyst Associate" 
    },
    {
      "certification": "- Certified Tableau Desktop Specialist"
    },
    {
      "certification": "- AWS Certified Machine Learning – Specialty – Amazon"
    }
  ],
  "references": [
    {
      "name": "Dr.Qing He",
      "relation": "Professor",
      "reference": "I have had my pleasure of serving as Sanket's MS project advisor for Fall 2018, during which he analyzed large-scale smartphone GPS and extracted their social travel behavior. Above all, I was impressed with Sanket's ability to understand and solve the problem efficiently, his choice of visualization library to show his work was very good. He is also good at explaining his reports and finding clearly. I was also impressed with the way he designed the probabilistic model and tableau dashboard. Sanket would be a true asset for any positions requiring R, Python, and Tableau and comes with my heartfelt recommendation."
    },
    {
      "name": "Prachi Sharma",
      "relation": "Previous Coworker",
      "reference": "Sanket's creative thinking, expertise, positive can-do attitude makes him an absolute pleasure to work with. He continually delivers results, goes above and beyond in providing exceptional work. He is very flexible, enthusiastic and hold the great interests towards technical domain. His strengths in staying across issues, pro-actively offering solutions and being adept at all aspects of communications make him a valuable contributor to team"
    }
  ]
}
